# Brewfile — Core packages for macOS.
# Managed by chezmoi. Applied via: brew bundle --file ~/.Brewfile
# Re-runs automatically when this file changes (run_onchange_ script).

# ── Package managers / taps ──────────────────────────────────────────────────
tap "homebrew/bundle"
tap "FelixKratz/formulae"        # sketchybar
tap "koekeishiya/formulae"       # yabai, skhd

# ── Shell ────────────────────────────────────────────────────────────────────
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "fzf"                       # required: PKGM-01

# ── Dotfiles manager ─────────────────────────────────────────────────────────
brew "chezmoi"

# ── Runtime manager ──────────────────────────────────────────────────────────
brew "mise"

# ── Editor ───────────────────────────────────────────────────────────────────
brew "neovim"                    # required: PKGM-01

# ── Terminal ─────────────────────────────────────────────────────────────────
cask "wezterm"                   # required: PKGM-01
brew "tmux"                      # required: PKGM-01

# ── Secrets ──────────────────────────────────────────────────────────────────
cask "1password-cli"             # required: PKGM-01 (op CLI)

# ── Window Management (macOS) ────────────────────────────────────────────────
brew "sketchybar"                # required: MACOS-01
brew "yabai"                     # required: MACOS-01
brew "skhd"                      # hotkey daemon for yabai
brew "lua"                       # sketchybar Lua config runtime
brew "switchaudio-osx"           # sketchybar audio widget
brew "nowplaying-cli"            # sketchybar media widget
cask "sf-symbols"                # sketchybar icon set

# ── Fonts ────────────────────────────────────────────────────────────────────
tap "homebrew/cask-fonts"
cask "font-meslo-lg-nerd-font"   # recommended for Powerlevel10k
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"              # sketchybar default font
cask "font-sf-pro"               # sketchybar default font

# ── CLI productivity ─────────────────────────────────────────────────────────
brew "bat"
brew "fd"
brew "ripgrep"
brew "btop"
brew "tldr"
brew "tree"
brew "lazygit"
brew "jq"
brew "git"
