# Brewfile — Core packages for macOS.
# Managed by chezmoi. Applied via: brew bundle --file ~/.Brewfile
# Re-runs automatically when this file changes (run_onchange_ script).

# ── Package managers / taps ──────────────────────────────────────────────────
tap "FelixKratz/formulae"        # sketchybar
tap "sst/tap"                    # opencode

# ── Shell ────────────────────────────────────────────────────────────────────
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "fzf"                       # required: PKGM-01

# ── Dotfiles manager ─────────────────────────────────────────────────────────
brew "chezmoi"

# ── Runtime manager ──────────────────────────────────────────────────────────
brew "mise"

# ── Editor ───────────────────────────────────────────────────────────────────
brew "neovim"                    # required: PKGM-01

# ── Terminal ─────────────────────────────────────────────────────────────────
cask "wezterm"                   # required: PKGM-01
brew "tmux"                      # required: PKGM-01

# ── Secrets ──────────────────────────────────────────────────────────────────
cask "1password-cli"             # required: PKGM-01 (op CLI)

# ── Window Management (macOS) ────────────────────────────────────────────────
brew "sketchybar"                # required: MACOS-01
brew "lua"                       # sketchybar Lua config runtime
brew "switchaudio-osx"           # sketchybar audio widget
brew "nowplaying-cli"            # sketchybar media widget
cask "sf-symbols"                # sketchybar icon set

# ── Fonts ────────────────────────────────────────────────────────────────────

cask "font-meslo-lg-nerd-font"   # recommended for Powerlevel10k
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"              # sketchybar default font
cask "font-sf-pro"               # sketchybar default font

# ── CLI productivity ─────────────────────────────────────────────────────────
brew "bat"
brew "fd"
brew "ripgrep"
brew "btop"
brew "tldr"
brew "tree"
brew "lazygit"
brew "jq"
brew "git"

# ── Rust ─────────────────────────────────────────────────────────────────────
brew "rust-analyzer"             # LSP server (toolchain managed by mise)

# ── Cloud / Kubernetes ───────────────────────────────────────────────────────
brew "kubectl"                   # Kubernetes CLI
brew "k9s"                       # Kubernetes TUI
cask "google-cloud-sdk"          # gcloud CLI + SDK
brew "awscli"                    # AWS CLI v2

# ── Fun / Eye candy ──────────────────────────────────────────────────────────
brew "cowsay"                    # ASCII cow (and friends) say things
brew "fortune"                   # random fortune cookies
brew "lolcat"                    # rainbow-coloured output
brew "figlet"                    # large ASCII-art text banners
brew "cmatrix"                   # The Matrix rain animation
brew "asciiquarium"              # aquarium in your terminal
brew "asciinema"                 # record & share terminal sessions
brew "jp2a"                      # convert JPEG images to ASCII art

# ── AI Coding Tools ──────────────────────────────────────────────────────────
cask "visual-studio-code"        # VS Code editor
brew "sst/tap/opencode"          # opencode AI coding agent (SST)
# claude  → managed by mise: npm:@anthropic-ai/claude-code
# codex   → managed by mise: npm:@openai/codex
